#1. Как выглядит структура django MVT паттерна (можно упрощённо)? Можно словами, можно нарисовать схему.
#3. Как выглядит структура проекта и приложения в Django? Если конкретнее, то что за файлы внутри каждого из них и для чего?

#37. Какой цикл ответа и запроса в Django?
#35. Расскажите о безопасности Django.
#В 33. чём разница между select_related и prefetc_related? Покажите синонемичный код на SQL
#31. Объясните авторизацию пользователя в Django?
#Разница между связью ForeignKey и OneToOne? Расскажите о примере использования обеих.    +ПРИМЕРЫ 3 СВЯЗЕЙ
#27. Что такое django ORM? Как получить все записи с модели? Как их отфильтровать или искать внутри? Перечислите все методы ORM.    +
#25. Как использовать django ORM для создания данных партиями / пачкой?    +все примеры (по одному, за раз и по три)